jajavi202/SUEM-Entrega-2/board/pin_mux.c
/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitBootPins
 * Description   : Calls initialization functions.
 *
 * END ****************************************************************************************************************/
void BOARD_InitBootPins(void)
{
    BOARD_InitPins();
    BOARD_InitLEDsPins();
    BOARD_InitDEBUG_UARTPins();
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '74', peripheral: GPIOB, signal: 'GPIO, 16', pin_signal: PTG0/KBI1_P16, direction: OUTPUT}
  - {pin_num: '73', peripheral: GPIOB, signal: 'GPIO, 17', pin_signal: PTG1/KBI1_P17, direction: OUTPUT}
  - {pin_num: '72', peripheral: GPIOB, signal: 'GPIO, 18', pin_signal: PTG2/KBI1_P18, direction: OUTPUT}
  - {pin_num: '32', peripheral: GPIOA, signal: 'GPIO, 16', pin_signal: PTC0/KBI0_P16/FTM2_CH0/ADC0_SE8, direction: INPUT}
  - {pin_num: '31', peripheral: GPIOA, signal: 'GPIO, 17', pin_signal: PTC1/KBI0_P17/FTM2_CH1/ADC0_SE9, direction: INPUT}
  - {pin_num: '25', peripheral: GPIOA, signal: 'GPIO, 18', pin_signal: PTC2/KBI0_P18/FTM2_CH2/ADC0_SE10, direction: INPUT}
  - {pin_num: '24', peripheral: GPIOA, signal: 'GPIO, 19', pin_signal: PTC3/KBI0_P19/FTM2_CH3/ADC0_SE11, direction: INPUT}
  - {pin_num: '75', peripheral: I2C1, signal: SCL, pin_signal: PTE1/KBI1_P1/SPI0_MOSI/I2C1_SCL}
  - {pin_num: '76', peripheral: I2C1, signal: SDA, pin_signal: PTE0/KBI1_P0/SPI0_SCK/TCLK1/I2C1_SDA}
  - {pin_num: '71', peripheral: GPIOB, signal: 'GPIO, 19', pin_signal: PTG3/KBI1_P19, direction: OUTPUT}
  - {pin_num: '46', peripheral: ADC, signal: 'SE, 2', pin_signal: PTA6/KBI0_P6/FTM2_FLT1/ACMP1_IN0/ADC0_SE2}
  - {pin_num: '45', peripheral: ADC, signal: 'SE, 3', pin_signal: PTA7/KBI0_P7/FTM2_FLT2/ACMP1_IN1/ADC0_SE3}
  - {pin_num: '62', peripheral: FTM0, signal: 'CH, 0', pin_signal: PTA0/KBI0_P0/FTM0_CH0/I2C0_4WSCLOUT/ACMP0_IN0/ADC0_SE0, direction: OUTPUT}
  - {pin_num: '34', peripheral: KBI1, signal: 'P, 27', pin_signal: PTH3/KBI1_P27/I2C1_SDA, direction: INPUT}
  - {pin_num: '33', peripheral: KBI1, signal: 'P, 28', pin_signal: PTH4/KBI1_P28/I2C1_SCL, direction: INPUT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitPins(void)
{

    gpio_pin_config_t KEY_1_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA16 (pin 32) */
    GPIO_PinInit(BOARD_INITPINS_KEY_1_GPIO_PORT, BOARD_INITPINS_KEY_1_PIN, &KEY_1_config);

    gpio_pin_config_t KEY_2_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA17 (pin 31) */
    GPIO_PinInit(BOARD_INITPINS_KEY_2_GPIO_PORT, BOARD_INITPINS_KEY_2_PIN, &KEY_2_config);

    gpio_pin_config_t KEY_3_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA18 (pin 25) */
    GPIO_PinInit(BOARD_INITPINS_KEY_3_GPIO_PORT, BOARD_INITPINS_KEY_3_PIN, &KEY_3_config);

    gpio_pin_config_t KEY_4_config = {
        .pinDirection = kGPIO_DigitalInput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTA19 (pin 24) */
    GPIO_PinInit(BOARD_INITPINS_KEY_4_GPIO_PORT, BOARD_INITPINS_KEY_4_PIN, &KEY_4_config);

    gpio_pin_config_t LED_G_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB16 (pin 74) */
    GPIO_PinInit(BOARD_INITPINS_LED_G_GPIO_PORT, BOARD_INITPINS_LED_G_PIN, &LED_G_config);

    gpio_pin_config_t LED_R_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB17 (pin 73) */
    GPIO_PinInit(BOARD_INITPINS_LED_R_GPIO_PORT, BOARD_INITPINS_LED_R_PIN, &LED_R_config);

    gpio_pin_config_t LED_Y_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB18 (pin 72) */
    GPIO_PinInit(BOARD_INITPINS_LED_Y_GPIO_PORT, BOARD_INITPINS_LED_Y_PIN, &LED_Y_config);

    gpio_pin_config_t PTG3_config = {
        .pinDirection = kGPIO_DigitalOutput,
        .outputLogic = 0U
    };
    /* Initialize GPIO functionality on pin PTB19 (pin 71) */
    GPIO_PinInit(BOARD_INITPINS_PTG3_GPIO_PORT, BOARD_INITPINS_PTG3_PIN, &PTG3_config);
    /* pin 62 is configured as FTM0_CH0 */
    PORT_SetPinSelect(kPORT_FTM0CH0, kPORT_FTM0_CH0_PTA0);
    /* pin 75,76 is configured as I2C1_SCL, I2C1_SDA */
    PORT_SetPinSelect(kPORT_I2C1, kPORT_I2C1_SCLPTE1_SDAPTE0);
}

/* clang-format off */
/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
BOARD_InitLEDsPins:
- options: {callFromInitBoot: 'true', coreID: core0, enableClock: 'true'}
- pin_list:
  - {pin_num: '50', peripheral: GPIOB, signal: 'GPIO, 23', pin_signal: PTG7/KBI1_P23/FTM2_CH5/SPI1_PCS, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '51', peripheral: GPIOB, signal: 'GPIO, 22', pin_signal: PTG6/KBI1_P22/FTM2_CH4/SPI1_MISO, direction: OUTPUT, gpio_init_state: 'true'}
  - {pin_num: '52', peripheral: GPIOB, signal: 'GPIO, 21', pin_signal: PTG5/KBI1_P21/FTM2_CH3/SPI1_MOSI, direction: OUTPUT, gpio_init_state: 'true'}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */
/* clang-format on */

/* FUNCTION ************************************************************************************************************
 *
 * Function Name : BOARD_InitLEDsPins
 * Description   : Configures pin routing and optionally pin electrical features.
 *
 * END ****************************************************************************************************************/
void BOARD_InitLEDsPins(void)
{

